Data Manipulation and analysis with pandas

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('data.csv')

## fetch the first 5 rows
df.head(5)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,EB54EF1154C3A78,Heather,Callahan,Mosley-David,Lake Jeffborough,Norway,043-797-5229,915.112.1727,urangel@espinoza-francis.net,2020-08-26,http://www.escobar.org/
1,2,10dAcafEBbA5FcA,Kristina,Ferrell,"Horn, Shepard and Watson",Aaronville,Andorra,932-062-1802,(209)172-7124x3651,xreese@hall-donovan.com,2020-04-27,https://tyler-pugh.info/
2,3,67DAB15Ebe4BE4a,Briana,Andersen,Irwin-Oneal,East Jordan,Nepal,8352752061,(567)135-1918,haleybraun@blevins-sexton.com,2022-03-22,https://www.mack-bell.net/
3,4,6d350C5E5eDB4EE,Patty,Ponce,Richardson Group,East Kristintown,Northern Mariana Islands,302.398.3833,196-189-7767x770,hohailey@anthony.com,2020-07-02,https://delacruz-freeman.org/
4,5,5820deAdCF23EFe,Kathleen,Mccormick,Carson-Burch,Andresmouth,Macao,001-184-153-9683x1497,552.051.2979x342,alvaradojesse@rangel-shields.com,2021-01-17,https://welch.info/

In [4]:
df.describe()

             Index
count  10000.00000
mean    5000.50000
std     2886.89568
min        1.00000
25%     2500.75000
50%     5000.50000
75%     7500.25000
max    10000.00000

In [5]:
df.dtypes

Index                 int64
Customer Id          object
First Name           object
Last Name            object
Company              object
City                 object
Country              object
Phone 1              object
Phone 2              object
Email                object
Subscription Date    object
Website              object
dtype: object

In [7]:
## handling missing values
# df.isnull()
df.isnull().any(axis=1)

0       False
1       False
2       False
3       False
4       False
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Length: 10000, dtype: bool

In [8]:
df.isnull().sum()

Index                0
Customer Id          0
First Name           0
Last Name            0
Company              0
City                 0
Country              0
Phone 1              0
Phone 2              0
Email                0
Subscription Date    0
Website              0
dtype: int64

In [9]:
# df.fillna(0)  # any missing value will be replaced with zero

# filling missing values with the mean of the column

# df['Sales_filNA'] = df['Sales'].fillna(df['Sales'].mean()) 
'''
this part is important in filling the missing data
'''

'\nthis part is important in filling the missing data\n'

In [10]:
## renaming the column

df = df.rename(columns={'Email':'Customer Email'})
df.head(2)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Customer Email,Subscription Date,Website
0,1,EB54EF1154C3A78,Heather,Callahan,Mosley-David,Lake Jeffborough,Norway,043-797-5229,915.112.1727,urangel@espinoza-francis.net,2020-08-26,http://www.escobar.org/
1,2,10dAcafEBbA5FcA,Kristina,Ferrell,"Horn, Shepard and Watson",Aaronville,Andorra,932-062-1802,(209)172-7124x3651,xreese@hall-donovan.com,2020-04-27,https://tyler-pugh.info/

In [11]:
## Change dataType
'''
df['Value_new'] = df['Value'].astype(float)

df['Value'].fillna(df['Value].mean()).astype(float)  <-- to manage the missing values
'''

"\ndf['Value_new'] = df['Value'].astype(float)\n\ndf['Value'].fillna(df['Value].mean()).astype(float)  <-- to manage the missing values\n"

In [13]:
'''
df["NEw Value"] = df['Value'].apply(lambda x:x*2)

'''
df.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Customer Email,Subscription Date,Website
0,1,EB54EF1154C3A78,Heather,Callahan,Mosley-David,Lake Jeffborough,Norway,043-797-5229,915.112.1727,urangel@espinoza-francis.net,2020-08-26,http://www.escobar.org/
1,2,10dAcafEBbA5FcA,Kristina,Ferrell,"Horn, Shepard and Watson",Aaronville,Andorra,932-062-1802,(209)172-7124x3651,xreese@hall-donovan.com,2020-04-27,https://tyler-pugh.info/
2,3,67DAB15Ebe4BE4a,Briana,Andersen,Irwin-Oneal,East Jordan,Nepal,8352752061,(567)135-1918,haleybraun@blevins-sexton.com,2022-03-22,https://www.mack-bell.net/
3,4,6d350C5E5eDB4EE,Patty,Ponce,Richardson Group,East Kristintown,Northern Mariana Islands,302.398.3833,196-189-7767x770,hohailey@anthony.com,2020-07-02,https://delacruz-freeman.org/
4,5,5820deAdCF23EFe,Kathleen,Mccormick,Carson-Burch,Andresmouth,Macao,001-184-153-9683x1497,552.051.2979x342,alvaradojesse@rangel-shields.com,2021-01-17,https://welch.info/

In [17]:
## Data Aggregating and Grouping

# grouped_mean = df.groupby('Product')['Value'].mean()
grouped_mean = df.groupby('City')['First Name'].apply(lambda x:x+" a")
print(grouped_mean)

City
Aaronstad      2149      Melody a
               6199       Tanya a
Aaronview      2650        Brad a
Aaronville     1       Kristina a
Abbottborough  8968      Tracie a
                          ...
Zimmermanside  373       Samuel a
Zoeburgh       9933    Cheyenne a
Zoetown        4773     Shannon a
Zoeview        5129      Thomas a
Zunigamouth    5626      Eileen a
Name: First Name, Length: 10000, dtype: object

In [18]:
# grouped_sum = df.groupby(['Product','Region'])['Value'].sum()

''' 
use multiple coloumns to group  by

'''

' \nuse multiple coloumns to group  by\n\n'

In [19]:
## agrrigate multiple Functions

''' 

grouped_agg = df.groupby('Region')['Value'].agg(['mean','sum','count'])
 
 '''

" \n\ngrouped_agg = df.groupby('Region')['Value'].agg(['mean','sum','count'])\n \n "

In [20]:
## Merging and joining DataFrame

df1 = pd.DataFrame({'Key':['A','B','C'],'Values1':[10,20,30]})
df2 = pd.DataFrame({'Key':['A','B','D'],'Values2':[11,22,32]})

In [21]:
df1

  Key  Values1
0   A       10
1   B       20
2   C       30

In [22]:
df2

  Key  Values2
0   A       11
1   B       22
2   D       32

In [23]:
## merge DATAFRAME on the 'key columns'

pd.merge(df1,df2,on="Key",how="inner")

  Key  Values1  Values2
0   A       10       11
1   B       20       22

In [24]:
pd.merge(df1,df2,on="Key",how="outer")

  Key  Values1  Values2
0   A     10.0     11.0
1   B     20.0     22.0
2   C     30.0      NaN
3   D      NaN     32.0

In [25]:
pd.merge(df1,df2,on="Key",how="left")

  Key  Values1  Values2
0   A       10     11.0
1   B       20     22.0
2   C       30      NaN

In [26]:
pd.merge(df1,df2,on="Key",how="right")

  Key  Values1  Values2
0   A     10.0       11
1   B     20.0       22
2   D      NaN       32